Tekla Open API Reference for Tekla Structures 2025
Distance.Equals Method (Distance)
 Indicates whether the current object is equal to another object of the same type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	Distance other
)
Public Function Equals (
	other As Distance
) As Boolean
Parameters
other
Type: Tekla.Structures.Datatype.Distance
The object to be compared with the current object.
Return Value
Type: Boolean
True if the current object is equal to the other object; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Distance Structure
Equals Overload
Tekla.Structures.Datatype Namespace